gueee/nanoELS-flow/nanoELS-flow/ESP32MotionControl.cpp
#include "ESP32MotionControl.h"

// Global instance
ESP32MotionControl esp32Motion;

// Static instance pointer for ISR access
ESP32MotionControl* ESP32MotionControl::instance = nullptr;

ESP32MotionControl::ESP32MotionControl() {
    instance = this;
    motionTaskHandle = nullptr;
    stepGeneratorTimer = nullptr;
    emergencyStop = false;
    
    // Initialize test sequence
    testSequence.active = false;
    testSequence.completed = false;
    testSequence.currentMove = 0;
    testSequence.cycleCount = 0;
    testSequence.maxCycles = 3;
    testSequence.moveStartTime = 0;
}

ESP32MotionControl::~ESP32MotionControl() {
    shutdown();
}

bool ESP32MotionControl::initialize() {
    Serial.println("Initializing ESP32 Motion Control - PID Position Controller");
    
    // Initialize hardware
    initializeGPIO();
    initializePID();
    initializeStepTimers();
    initializeTestSequence();
    
    // Create motion control task
    BaseType_t result = xTaskCreatePinnedToCore(
        motionControlTask,
        "MotionControl",
        4096,
        this,
        2,  // High priority
        &motionTaskHandle,
        1   // Run on Core 1
    );
    
    if (result != pdPASS) {
        Serial.println("Failed to create motion control task");
        return false;
    }
    
    Serial.println("✓ ESP32 Motion Control initialized successfully");
    return true;
}

void ESP32MotionControl::shutdown() {
    // Stop test sequence
    stopTestSequence();
    
    // Disable all axes
    disableAxis(0);
    disableAxis(1);
    
    // Stop step generator timer
    if (stepGeneratorTimer) {
        timerEnd(stepGeneratorTimer);
        stepGeneratorTimer = nullptr;
    }
    
    // Delete motion control task
    if (motionTaskHandle) {
        vTaskDelete(motionTaskHandle);
        motionTaskHandle = nullptr;
    }
    
    Serial.println("ESP32 Motion Control shutdown complete");
}

void ESP32MotionControl::initializeGPIO() {
    // X-axis (axis 0) - Configuration using setup section constants
    axes[0].stepPin = X_STEP;
    axes[0].dirPin = X_DIR;
    axes[0].enablePin = X_ENA;
    // Calculate pulses per mm from setup constants: MOTOR_STEPS_X steps per SCREW_X_DU deci-microns
    float stepsPerMM_X = (float)MOTOR_STEPS_X / ((float)SCREW_X_DU / 10000.0);
    axes[0].pulsesPerMM = FLOAT_TO_FIXED(stepsPerMM_X);
    Serial.printf("*** X-AXIS SETUP: MOTOR_STEPS_X=%d, SCREW_X_DU=%d, stepsPerMM=%.1f ***\n", 
                  (int)MOTOR_STEPS_X, (int)SCREW_X_DU, stepsPerMM_X);
    axes[0].maxVelocity = FLOAT_TO_FIXED(MAX_VELOCITY_X_USER * stepsPerMM_X);  // Convert mm/s to steps/s
    axes[0].maxAcceleration = FLOAT_TO_FIXED(MAX_ACCELERATION_X_USER * stepsPerMM_X);  // Convert mm/s² to steps/s²
    axes[0].invertEnable = INVERT_X_ENABLE;
    axes[0].invertStep = INVERT_X_STEP;
    
    // Z-axis (axis 1) - Configuration using setup section constants
    axes[1].stepPin = Z_STEP;
    axes[1].dirPin = Z_DIR;
    axes[1].enablePin = Z_ENA;
    // Calculate pulses per mm from setup constants: MOTOR_STEPS_Z steps per SCREW_Z_DU deci-microns
    float stepsPerMM_Z = (float)MOTOR_STEPS_Z / ((float)SCREW_Z_DU / 10000.0);
    axes[1].pulsesPerMM = FLOAT_TO_FIXED(stepsPerMM_Z);
    Serial.printf("*** Z-AXIS SETUP: MOTOR_STEPS_Z=%d, SCREW_Z_DU=%d, stepsPerMM=%.1f ***\n", 
                  (int)MOTOR_STEPS_Z, (int)SCREW_Z_DU, stepsPerMM_Z);
    axes[1].maxVelocity = FLOAT_TO_FIXED(MAX_VELOCITY_Z_USER * stepsPerMM_Z);  // Convert mm/s to steps/s
    axes[1].maxAcceleration = FLOAT_TO_FIXED(MAX_ACCELERATION_Z_USER * stepsPerMM_Z);  // Convert mm/s² to steps/s²
    axes[1].invertEnable = INVERT_Z_ENABLE;
    axes[1].invertStep = INVERT_Z_STEP;
    
    // Initialize GPIO pins and state
    for (int i = 0; i < 2; i++) {
        pinMode(axes[i].stepPin, OUTPUT);
        pinMode(axes[i].dirPin, OUTPUT);
        pinMode(axes[i].enablePin, OUTPUT);
        
        // Initialize step and direction pins considering inversion
        bool stepLow = axes[i].invertStep ? HIGH : LOW;
        digitalWrite(axes[i].stepPin, stepLow);
        digitalWrite(axes[i].dirPin, LOW);  // Direction will be set during moves
        // CRITICAL: Hardware-specific enable pin polarity
        // Using hardware constants for proper inversion
        bool disableState = axes[i].invertEnable ? HIGH : LOW;
        digitalWrite(axes[i].enablePin, disableState);  // Disable initially
        
        // Initialize fixed-point position and state
        axes[i].currentPosition = 0;
        axes[i].commandedPosition = 0;
        axes[i].positionError = 0;
        axes[i].stepCount = 0;
        axes[i].stepsToGo = 0;
        axes[i].stepInterval = 1000000;  // 1 Hz default
        axes[i].stepState = false;
        axes[i].stepPending = false;
        axes[i].enabled = false;
        axes[i].moving = false;
        axes[i].state = AxisConfig::IDLE;
        
        // Initialize safety limits (using setup section constants)
        float maxTravel = (i == 0) ? (float)MAX_TRAVEL_MM_X : (float)MAX_TRAVEL_MM_Z;
        axes[i].minPosition = FLOAT_TO_FIXED(-maxTravel * FIXED_TO_FLOAT(axes[i].pulsesPerMM));
        axes[i].maxPosition = FLOAT_TO_FIXED(maxTravel * FIXED_TO_FLOAT(axes[i].pulsesPerMM));
        axes[i].limitsEnabled = true;  // Enable software limits by default
        
        // Initialize motion profile
        axes[i].profile.currentPhase = MotionProfile::IDLE;
        axes[i].profile.targetPosition = 0;
        axes[i].profile.currentPosition = 0;
        axes[i].profile.currentVelocity = 0;
        axes[i].profile.moveActive = false;
        axes[i].profile.moveCompleted = false;
        
        // Initialize profile update timing
        axes[i].lastProfileUpdate = 0;
        axes[i].profileUpdateInterval = 500;  // 500μs = 2kHz like ClearPath
    }
    
    Serial.println("✓ GPIO initialized with setup section constants (fixed-point)");
    Serial.printf("  X-axis: Dir=%s, Enable=%s, Step=%s\n", 
                 INVERT_X ? "INV" : "NORM",
                 axes[0].invertEnable ? "INV" : "NORM",
                 axes[0].invertStep ? "INV" : "NORM");
    Serial.printf("  Z-axis: Dir=%s, Enable=%s, Step=%s\n", 
                 INVERT_Z ? "INV" : "NORM",
                 axes[1].invertEnable ? "INV" : "NORM",
                 axes[1].invertStep ? "INV" : "NORM");
    Serial.println("AXIS CONFIGURATION FROM SETUP CONSTANTS:");
    Serial.printf("  X-axis: %.1f steps/mm, %.1f mm/s max, screw=%.1fmm, steps=%d\n",
                 FIXED_TO_FLOAT(axes[0].pulsesPerMM), 
                 MAX_VELOCITY_X_USER,
                 (float)SCREW_X_DU / 10000.0,
                 (int)MOTOR_STEPS_X);
    Serial.printf("  Z-axis: %.1f steps/mm, %.1f mm/s max, screw=%.1fmm, steps=%d\n",
                 FIXED_TO_FLOAT(axes[1].pulsesPerMM), 
                 MAX_VELOCITY_Z_USER,
                 (float)SCREW_Z_DU / 10000.0,
                 (int)MOTOR_STEPS_Z);
    
    // Enable axes by default for motion capability
    Serial.println("Enabling axes by default...");
    enableAxis(0);  // Enable X-axis
    enableAxis(1);  // Enable Z-axis
}

void ESP32MotionControl::initializePID() {
    // Initialize PID controllers for both axes using setup section constants
    for (int i = 0; i < 2; i++) {
        axes[i].pid.kP = FLOAT_TO_FIXED(PID_KP);      // Proportional gain from setup
        axes[i].pid.kI = FLOAT_TO_FIXED(PID_KI);      // Integral gain from setup
        axes[i].pid.kD = FLOAT_TO_FIXED(PID_KD);      // Derivative gain from setup
        axes[i].pid.lastError = 0;
        axes[i].pid.integral = 0;
        axes[i].pid.maxOutput = FLOAT_TO_FIXED(100.0);  // Maximum velocity command
        axes[i].pid.minOutput = FLOAT_TO_FIXED(-100.0); // Minimum velocity command
        axes[i].pid.lastUpdateTime = 0;
    }
    
    Serial.printf("✓ PID controllers initialized: kP=%.2f, kI=%.2f, kD=%.2f\n", PID_KP, PID_KI, PID_KD);
}

