gueee/nanoELS-flow/nanoELS-flow/ESP32MotionControl.cpp
void ESP32MotionControl::initializeStepTimers() {
    // Initialize single step generator timer (2kHz like ClearPath)
    // Dual compatibility for Arduino IDE 3.x and PlatformIO 2.x
    
    // Check which API version we're using
    #ifdef ESP_ARDUINO_VERSION_MAJOR
        versionMajor = ESP_ARDUINO_VERSION_MAJOR;
    #else
        versionMajor = 2;  // Legacy/2.x API
    #endif
    
    #ifdef ESP_ARDUINO_VERSION_MAJOR
        #if ESP_ARDUINO_VERSION_MAJOR >= 3
            // Arduino IDE ESP32 3.x API - CORRECT implementation
            // For 2kHz interrupt rate, we need a base frequency higher than 2kHz
            // Using 1MHz base frequency for precise timing control
            stepGeneratorTimer = timerBegin(1000000);  // 1MHz base frequency
            
            if (stepGeneratorTimer != nullptr) {
                // Attach the interrupt handler
                timerAttachInterrupt(stepGeneratorTimer, &stepGeneratorISR);
                
                // Set alarm value: 1MHz / 500 = 2kHz interrupt rate
                timerAlarm(stepGeneratorTimer, 500, true, 0);  // 500 ticks = 500μs period
                
                // Timer should auto-start after timerAlarm, but call start to be sure
                timerStart(stepGeneratorTimer);
            }
        #else
            // Arduino IDE ESP32 2.x API  
            stepGeneratorTimer = timerBegin(0, 80, true);  // Timer 0, prescaler 80, count up
            timerAttachInterrupt(stepGeneratorTimer, &stepGeneratorISR, true);
            timerAlarmWrite(stepGeneratorTimer, 500, true);  // 500μs
            timerAlarmEnable(stepGeneratorTimer);
            Serial.println("✓ Step generator timer initialized (2kHz) - Arduino 2.x API");
        #endif
    #else
        // PlatformIO/older versions - assume 2.x API
        stepGeneratorTimer = timerBegin(0, 80, true);  // Timer 0, prescaler 80, count up
        timerAttachInterrupt(stepGeneratorTimer, &stepGeneratorISR, true);
        timerAlarmWrite(stepGeneratorTimer, 500, true);  // 500μs
        timerAlarmEnable(stepGeneratorTimer);
        Serial.println("✓ Step generator timer initialized (2kHz) - Legacy API");
    #endif
}

void ESP32MotionControl::initializeTestSequence() {
    // Test sequence: Move Z left 20mm, X in 8mm, Z right 20mm, X out 8mm
    testSequence.moves[0] = {0.0, -20.0, 2000};  // Z left 20mm, hold 2s
    testSequence.moves[1] = {8.0, -20.0, 2000};  // X in 8mm, hold 2s
    testSequence.moves[2] = {8.0, 0.0, 2000};    // Z right 20mm, hold 2s
    testSequence.moves[3] = {0.0, 0.0, 2000};    // X out 8mm, hold 2s
    
    testSequence.currentMove = 0;
    testSequence.cycleCount = 0;
    testSequence.maxCycles = 3;
    testSequence.moveStartTime = 0;
    testSequence.active = false;
    testSequence.completed = false;
    
    Serial.println("✓ Test sequence initialized (3 cycles, 20mm Z, 8mm X)");
}

void IRAM_ATTR ESP32MotionControl::stepGeneratorISR() {
    if (instance) {
        instance->isrCount++;  // Track ISR executions
        // 2kHz step generator - handles both axes
        instance->generateStepPulse(0);  // X-axis
        instance->generateStepPulse(1);  // Z-axis
    }
}

void ESP32MotionControl::generateStepPulse(int axis) {
    if (!axes[axis].enabled || emergencyStop) return;
    
    // Check if step is needed (based on profile or steps remaining)
    if (axes[axis].stepsToGo <= 0 && !axes[axis].stepPending) return;
    
    // Generate step pulse with hardware-specific inversion
    if (axes[axis].stepState) {
        // Step pulse LOW phase (considering inversion)
        bool lowState = axes[axis].invertStep ? HIGH : LOW;
        digitalWrite(axes[axis].stepPin, lowState);
        axes[axis].stepState = false;
        axes[axis].stepPending = false;
    } else if (axes[axis].stepPending || axes[axis].stepsToGo > 0) {
        // Generate multiple steps per ISR cycle for high speeds
        int32_t stepsThisCycle = min((int32_t)axes[axis].stepsToGo, (int32_t)50);  // Max 50 steps per cycle
        if (stepsThisCycle < 1) stepsThisCycle = 1;
        
        // Step pulse HIGH phase (considering inversion)
        bool highState = axes[axis].invertStep ? LOW : HIGH;
        digitalWrite(axes[axis].stepPin, highState);
        axes[axis].stepState = true;
        axes[axis].stepPending = true;
        
        // Update position and counters for all steps in this cycle
        axes[axis].stepCount += stepsThisCycle;
        stepsPulsed[axis] += stepsThisCycle;  // Track actual pulses
        if (axes[axis].stepsToGo > 0) {
            axes[axis].stepsToGo -= stepsThisCycle;
        }
        
        // Update position based on step direction for all steps
        bool direction = digitalRead(axes[axis].dirPin);
        // Direction logic now handled only by hardware constants in updateStepGeneration()
        
        if (direction) {
            axes[axis].currentPosition += stepsThisCycle;  // +N steps
        } else {
            axes[axis].currentPosition -= stepsThisCycle;  // -N steps
        }
    }
}

void ESP32MotionControl::motionControlTask(void* parameter) {
    ESP32MotionControl* controller = static_cast<ESP32MotionControl*>(parameter);
    
    const TickType_t xFrequency = pdMS_TO_TICKS(1);  // 1kHz update rate (faster than ClearPath)
    TickType_t xLastWakeTime = xTaskGetTickCount();
    
    while (true) {
        vTaskDelayUntil(&xLastWakeTime, xFrequency);
        
        if (controller->emergencyStop) {
            continue;
        }
        
        // Update motion profiles for both axes
        controller->updateAxisProfile(0);  // X-axis
        controller->updateAxisProfile(1);  // Z-axis
        
        // Update test sequence
        if (controller->testSequence.active) {
            controller->updateTestSequence();
        }
    }
}

// Motion profile update (ClearPath-inspired)
void ESP32MotionControl::updateAxisProfile(int axis) {
    if (!axes[axis].enabled || emergencyStop) return;
    
    MotionProfile& profile = axes[axis].profile;
    
