gueee/nanoELS-flow/nanoELS-flow/ESP32MotionControl.cpp
    // Skip if no active move
    if (!profile.moveActive) {
        axes[axis].moving = false;
        axes[axis].state = AxisConfig::IDLE;
        return;
    }
    
    uint32_t currentTime = millis();
    uint32_t elapsedTime = currentTime - profile.moveStartTime;
    
    // Update profile phase and calculate current velocity
    updateProfilePhase(axis);
    int32_t targetVelocity = calculateProfileVelocity(axis);
    
    // Update step generation based on profile
    updateStepTiming(axis);
    
    // Update motion state
    if (profile.currentPhase == MotionProfile::COMPLETED) {
        axes[axis].moving = false;
        axes[axis].state = AxisConfig::IDLE;
        profile.moveActive = false;
        profile.moveCompleted = true;
        axes[axis].stepsToGo = 0;
    } else {
        axes[axis].moving = true;
        axes[axis].state = AxisConfig::PROFILE_MOVE;
    }
}

int32_t ESP32MotionControl::calculatePIDOutput(int axis) {
    PIDController& pid = axes[axis].pid;
    uint32_t currentTime = millis();
    
    if (pid.lastUpdateTime == 0) {
        pid.lastUpdateTime = currentTime;
        return 0.0;
    }
    
    float deltaTime = (currentTime - pid.lastUpdateTime) / 1000.0;  // Convert to seconds
    if (deltaTime <= 0) return 0.0;
    
    float error = axes[axis].positionError;
    
    // Proportional term
    float pTerm = pid.kP * error;
    
    // Integral term
    pid.integral += error * deltaTime;
    float iTerm = pid.kI * pid.integral;
    
    // Derivative term
    float dError = (error - pid.lastError) / deltaTime;
    float dTerm = pid.kD * dError;
    
    // Calculate total output
    float output = pTerm + iTerm + dTerm;
    
    // Limit output
    if (output > pid.maxOutput) output = pid.maxOutput;
    if (output < pid.minOutput) output = pid.minOutput;
    
    // Store values for next iteration
    pid.lastError = error;
    pid.lastUpdateTime = currentTime;
    
    return output;
}

// Calculate motion profile for triangular velocity (ClearPath-inspired)
void ESP32MotionControl::calculateMotionProfile(int axis, int32_t targetPos) {
    MotionProfile& profile = axes[axis].profile;
    
    // Calculate move parameters
    profile.startPosition = axes[axis].currentPosition;
    profile.targetPosition = targetPos;
    profile.totalDistance = abs(targetPos - axes[axis].currentPosition);
    
    if (profile.totalDistance == 0) {
        profile.moveActive = false;
        return;
    }
    
    // Calculate acceleration distance (distance to reach max velocity)
    int32_t maxVel = axes[axis].maxVelocity;
    int32_t maxAccel = axes[axis].maxAcceleration;
    
    profile.accelDistance = calculateAccelDistance(maxVel, maxAccel);
    profile.decelDistance = profile.accelDistance;  // Symmetric profile
    
    // Check if we can reach max velocity
    if (profile.accelDistance + profile.decelDistance > profile.totalDistance) {
        // Triangular profile - can't reach max velocity
        profile.accelDistance = profile.totalDistance / 2;
        profile.decelDistance = profile.totalDistance - profile.accelDistance;
        maxVel = calculateProfileVelocity(axis);  // Recalculate peak velocity
    }
    
    // Calculate timing
    profile.accelTime = calculateAccelTime(maxVel, maxAccel);
    profile.decelTime = profile.accelTime;
    
    int32_t constantDistance = profile.totalDistance - profile.accelDistance - profile.decelDistance;
    if (constantDistance > 0 && maxVel > 0) {
        profile.constantTime = (constantDistance * 1000) / FIXED_TO_FLOAT(maxVel);  // ms
    } else {
        profile.constantTime = 0;
    }
    
    // Initialize move state
    profile.currentPhase = MotionProfile::ACCELERATION;
    profile.currentVelocity = 0;
    profile.moveStartTime = millis();
    profile.phaseStartTime = profile.moveStartTime;
    profile.moveActive = true;
    profile.moveCompleted = false;
    
    // Set direction using only hardware constants (INVERT_X/INVERT_Z)
    bool direction = (targetPos > axes[axis].currentPosition);
    // Apply hardware-specific direction inversion
    if ((axis == 0 && INVERT_X) || (axis == 1 && INVERT_Z)) {
        direction = !direction;
    }
    digitalWrite(axes[axis].dirPin, direction ? HIGH : LOW);
    
    Serial.printf("Profile calculated: Axis %d, Distance=%d, AccelDist=%d, MaxVel=%d, MoveActive=%s\n", 
                 axis, profile.totalDistance, profile.accelDistance, maxVel, 
                 profile.moveActive ? "YES" : "NO");
}

// Update motion profile phase
void ESP32MotionControl::updateProfilePhase(int axis) {
    MotionProfile& profile = axes[axis].profile;
    uint32_t currentTime = millis();
    uint32_t elapsedTime = currentTime - profile.phaseStartTime;
    
    switch (profile.currentPhase) {
        case MotionProfile::ACCELERATION:
            if (elapsedTime >= FIXED_TO_FLOAT(profile.accelTime)) {
                profile.currentPhase = MotionProfile::CONSTANT_VELOCITY;
                profile.phaseStartTime = currentTime;
            }
            break;
            
        case MotionProfile::CONSTANT_VELOCITY:
            if (elapsedTime >= profile.constantTime) {
                profile.currentPhase = MotionProfile::DECELERATION;
                profile.phaseStartTime = currentTime;
            }
            break;
            
        case MotionProfile::DECELERATION:
            if (elapsedTime >= FIXED_TO_FLOAT(profile.decelTime)) {
                profile.currentPhase = MotionProfile::COMPLETED;
                profile.currentVelocity = 0;
            }
            break;
            
        default:
            break;
    }
}

// Calculate current velocity based on profile phase
int32_t ESP32MotionControl::calculateProfileVelocity(int axis) {
    MotionProfile& profile = axes[axis].profile;
    uint32_t currentTime = millis();
    uint32_t elapsedTime = currentTime - profile.phaseStartTime;
    
    int32_t maxVel = axes[axis].maxVelocity;
    int32_t maxAccel = axes[axis].maxAcceleration;
    
