gueee/nanoELS-flow/nanoELS-flow/ESP32MotionControl.cpp
    switch (profile.currentPhase) {
        case MotionProfile::ACCELERATION: {
            // Linear acceleration
            int32_t velocity = (maxAccel * elapsedTime) / 1000;  // Convert ms to seconds
            profile.currentVelocity = min(velocity, maxVel);
            break;
        }
        
        case MotionProfile::CONSTANT_VELOCITY:
            profile.currentVelocity = maxVel;
            break;
            
        case MotionProfile::DECELERATION: {
            // Linear deceleration
            int32_t decelElapsed = elapsedTime;
            int32_t velocity = maxVel - (maxAccel * decelElapsed) / 1000;
            profile.currentVelocity = max(velocity, (int32_t)0);
            break;
        }
        
        default:
            profile.currentVelocity = 0;
            break;
    }
    
    return profile.currentVelocity;
}

// Update step timing based on current velocity
void ESP32MotionControl::updateStepTiming(int axis) {
    int32_t velocity = axes[axis].profile.currentVelocity;
    
    if (velocity <= 0) {
        axes[axis].stepsToGo = 0;
        return;
    }
    
    // Calculate steps needed in next 500μs (2kHz rate)
    int32_t velocityHz = FIXED_TO_FLOAT(velocity);
    int32_t stepsNeeded = (velocityHz * 500) / 1000000;  // steps in 500μs
    
    // Allow multiple steps per ISR cycle for high speeds
    if (stepsNeeded < 1) stepsNeeded = 1;  // Minimum 1 step
    if (stepsNeeded > 50) stepsNeeded = 50;  // Maximum 50 steps per cycle (safety limit)
    
    axes[axis].stepsToGo = stepsNeeded;
}

void ESP32MotionControl::updateStepGeneration(int axis) {
    if (!axes[axis].enabled || emergencyStop) {
        axes[axis].stepsToGo = 0;
        axes[axis].moving = false;
        return;
    }
    
    // Get position error in fixed-point format
    int32_t error = axes[axis].positionError;
    int32_t absError = abs(error);
    
    // If within tolerance, stop movement
    if (absError < FLOAT_TO_FIXED(0.01)) {  // Within 0.01mm tolerance
        axes[axis].stepsToGo = 0;
        axes[axis].moving = false;
        return;
    }
    
    // Set direction based on error direction using only hardware constants
    bool direction = error > 0;
    // Apply hardware-specific direction inversion (single source of truth)
    if ((axis == 0 && INVERT_X) || (axis == 1 && INVERT_Z)) {
        direction = !direction;
    }
    digitalWrite(axes[axis].dirPin, direction ? HIGH : LOW);
    
    // Calculate step rate based on position error (simple proportional control)
    float errorMM = FIXED_TO_FLOAT(absError);
    float maxFreqHz = FIXED_TO_FLOAT(axes[axis].maxVelocity) * 1000.0;  // Convert to Hz
    float minFreqHz = 100.0;  // Minimum step rate
    
    // Proportional control: larger error = higher frequency
    float freq = errorMM * 2000.0;  // Scale factor for responsiveness
    if (freq > maxFreqHz) freq = maxFreqHz;
    if (freq < minFreqHz) freq = minFreqHz;
    
    // Convert to step interval for ISR (the ISR runs at 2kHz, so calculate steps per ISR cycle)
    float stepsPerSecond = freq;
    float stepsPerISRCycle = stepsPerSecond / 2000.0;  // 2kHz ISR rate
    
    // Set minimum of 1 step if movement is needed
    if (stepsPerISRCycle < 1.0 && absError > 0) stepsPerISRCycle = 1.0;
    
    axes[axis].stepsToGo = (int32_t)stepsPerISRCycle;
    axes[axis].moving = (axes[axis].stepsToGo > 0);
}

void ESP32MotionControl::updateTestSequence() {
    if (!testSequence.active || testSequence.completed) return;
    
    uint32_t currentTime = millis();
    
    // Check if we need to start a new move
    if (testSequence.moveStartTime == 0) {
        testSequence.moveStartTime = currentTime;
        
        // Set target positions for current move
        TestSequence::Move& move = testSequence.moves[testSequence.currentMove];
        setTargetPosition(0, move.xTarget);  // X-axis
        setTargetPosition(1, move.zTarget);  // Z-axis
        
        Serial.printf("Test Move %d: X=%.1fmm, Z=%.1fmm\n", 
                     testSequence.currentMove, move.xTarget, move.zTarget);
    }
    
    // Check if hold time has elapsed
    TestSequence::Move& currentMove = testSequence.moves[testSequence.currentMove];
    if (currentTime - testSequence.moveStartTime >= currentMove.holdTime) {
        // Move to next move
        testSequence.currentMove++;
        testSequence.moveStartTime = 0;
        
        // Check if we completed all moves in a cycle
        if (testSequence.currentMove >= 4) {
            testSequence.currentMove = 0;
            testSequence.cycleCount++;
            
            Serial.printf("Test Cycle %d completed\n", testSequence.cycleCount);
            
            // Check if we completed all cycles
            if (testSequence.cycleCount >= testSequence.maxCycles) {
                testSequence.active = false;
                testSequence.completed = true;
                Serial.println("==== TEST SEQUENCE COMPLETED ====");
                Serial.printf("Completed %d cycles successfully\n", testSequence.maxCycles);
                Serial.println("Press ENTER to restart test sequence");
                Serial.println("====================================");
            }
        }
    }
}

// Fixed-point math helper methods
int32_t ESP32MotionControl::mmToSteps(int axis, float mm) {
    if (axis < 0 || axis >= 2) return 0;
    float pulsesPerMM = FIXED_TO_FLOAT(axes[axis].pulsesPerMM);
    int32_t steps = (int32_t)(mm * pulsesPerMM);
    Serial.printf("*** mmToSteps: axis=%d, mm=%.3f, pulsesPerMM=%.1f, steps=%d ***\n", 
                  axis, mm, pulsesPerMM, steps);
    return steps;
}

float ESP32MotionControl::stepsToMM(int axis, int32_t steps) {
    if (axis < 0 || axis >= 2) return 0.0;
    return (float)steps / FIXED_TO_FLOAT(axes[axis].pulsesPerMM);
}

int32_t ESP32MotionControl::calculateAccelDistance(int32_t velocity, int32_t acceleration) {
    if (acceleration <= 0) return 0;
    // d = v² / (2*a)
    int64_t velSquared = (int64_t)velocity * velocity;
    return (int32_t)(velSquared / (2 * acceleration));
}

int32_t ESP32MotionControl::calculateAccelTime(int32_t velocity, int32_t acceleration) {
    if (acceleration <= 0) return 0;
    // t = v / a (in milliseconds)
    return FLOAT_TO_FIXED((FIXED_TO_FLOAT(velocity) * 1000.0) / FIXED_TO_FLOAT(acceleration));
}

