gueee/nanoELS-flow/nanoELS-flow/ESP32MotionControl.cpp
// Enhanced public interface methods with safety bounds
bool ESP32MotionControl::setTargetPosition(int axis, float positionMM) {
    if (axis < 0 || axis >= 2) return false;
    
    // CRITICAL: Check software limits before moving
    if (!isPositionSafe(axis, positionMM)) {
        Serial.printf("ERROR: Target position %.2fmm is outside safe limits for axis %d\n", positionMM, axis);
        return false;
    }
    
    // Convert to fixed-point and start profile move
    int32_t targetSteps = mmToSteps(axis, positionMM);
    calculateMotionProfile(axis, targetSteps);
    return true;
}

bool ESP32MotionControl::moveToPosition(int axis, float positionMM) {
    return setTargetPosition(axis, positionMM);
}

bool ESP32MotionControl::moveRelative(int axis, int steps) {
    if (axis < 0 || axis >= 2) return false;
    if (emergencyStop) return false;
    
    // Convert current position to steps and add relative movement
    float currentPosMM = getPosition(axis);
    float stepSizeMM = stepsToMM(axis, 1);  // Size of one step in mm
    float relativeMM = steps * stepSizeMM;
    float targetPosMM = currentPosMM + relativeMM;
    
    // Check if target position is safe
    if (!isPositionSafe(axis, targetPosMM)) {
        Serial.printf("Relative move blocked - target position %.3f mm unsafe for axis %d\n", 
                     targetPosMM, axis);
        return false;
    }
    
    return setTargetPosition(axis, targetPosMM);
}


float ESP32MotionControl::getPosition(int axis) {
    if (axis < 0 || axis >= 2) return 0.0;
    return stepsToMM(axis, axes[axis].currentPosition);
}

float ESP32MotionControl::getTargetPosition(int axis) {
    if (axis < 0 || axis >= 2) return 0.0;
    return stepsToMM(axis, axes[axis].profile.targetPosition);
}

float ESP32MotionControl::getPositionError(int axis) {
    if (axis < 0 || axis >= 2) return 0.0;
    int32_t error = axes[axis].profile.targetPosition - axes[axis].currentPosition;
    return stepsToMM(axis, error);
}

// Safety limit methods
bool ESP32MotionControl::setSoftwareLimits(int axis, float minMM, float maxMM) {
    if (axis < 0 || axis >= 2) return false;
    
    axes[axis].minPosition = mmToSteps(axis, minMM);
    axes[axis].maxPosition = mmToSteps(axis, maxMM);
    axes[axis].limitsEnabled = true;
    
    Serial.printf("Axis %d limits set: %.2fmm to %.2fmm\n", axis, minMM, maxMM);
    return true;
}

void ESP32MotionControl::getSoftwareLimits(int axis, float& minMM, float& maxMM) {
    if (axis < 0 || axis >= 2) {
        minMM = maxMM = 0.0;
        return;
    }
    
    minMM = stepsToMM(axis, axes[axis].minPosition);
    maxMM = stepsToMM(axis, axes[axis].maxPosition);
}

bool ESP32MotionControl::isPositionSafe(int axis, float positionMM) {
    if (axis < 0 || axis >= 2) return false;
    
    if (!axes[axis].limitsEnabled) return true;  // No limits enabled
    
    int32_t positionSteps = mmToSteps(axis, positionMM);
    
    if (positionSteps < axes[axis].minPosition) {
        Serial.printf("Position %.2fmm below minimum %.2fmm\n", 
                     positionMM, stepsToMM(axis, axes[axis].minPosition));
        return false;
    }
    
    if (positionSteps > axes[axis].maxPosition) {
        Serial.printf("Position %.2fmm above maximum %.2fmm\n", 
                     positionMM, stepsToMM(axis, axes[axis].maxPosition));
        return false;
    }
    
    return true;
}

bool ESP32MotionControl::isMoving(int axis) {
    if (axis < 0 || axis >= 2) return false;
    return axes[axis].moving;
}

bool ESP32MotionControl::moveCompleted(int axis) {
    if (axis < 0 || axis >= 2) return true;
    return axes[axis].profile.moveCompleted;
}

bool ESP32MotionControl::setMotionLimits(int axis, float maxVel, float maxAccel) {
    if (axis < 0 || axis >= 2) return false;
    
    // Convert to fixed-point steps per second
    float pulsesPerMM = FIXED_TO_FLOAT(axes[axis].pulsesPerMM);
    axes[axis].maxVelocity = FLOAT_TO_FIXED(maxVel * pulsesPerMM);
    axes[axis].maxAcceleration = FLOAT_TO_FIXED(maxAccel * pulsesPerMM);
    
    return true;
}

void ESP32MotionControl::getMotionLimits(int axis, float& maxVel, float& maxAccel) {
    if (axis < 0 || axis >= 2) return;
    
    float pulsesPerMM = FIXED_TO_FLOAT(axes[axis].pulsesPerMM);
    maxVel = FIXED_TO_FLOAT(axes[axis].maxVelocity) / pulsesPerMM;
    maxAccel = FIXED_TO_FLOAT(axes[axis].maxAcceleration) / pulsesPerMM;
}

MotionProfile::Phase ESP32MotionControl::getMotionPhase(int axis) {
    if (axis < 0 || axis >= 2) return MotionProfile::IDLE;
    return axes[axis].profile.currentPhase;
}

float ESP32MotionControl::getProfileVelocity(int axis) {
    if (axis < 0 || axis >= 2) return 0.0;
    float pulsesPerMM = FIXED_TO_FLOAT(axes[axis].pulsesPerMM);
    return FIXED_TO_FLOAT(axes[axis].profile.currentVelocity) / pulsesPerMM;
}

bool ESP32MotionControl::enableAxis(int axis) {
    if (axis < 0 || axis >= 2) return false;
    
    axes[axis].enabled = true;
    // CRITICAL: Use hardware-specific enable pin polarity
    bool enableState = axes[axis].invertEnable ? LOW : HIGH;
    digitalWrite(axes[axis].enablePin, enableState);
    Serial.printf("Axis %d enabled (invert=%s)\n", axis, axes[axis].invertEnable ? "true" : "false");
    return true;
}

bool ESP32MotionControl::disableAxis(int axis) {
    if (axis < 0 || axis >= 2) return false;
    
    axes[axis].enabled = false;
    // CRITICAL: Use hardware-specific enable pin polarity
    bool disableState = axes[axis].invertEnable ? HIGH : LOW;
    digitalWrite(axes[axis].enablePin, disableState);
    
    // Stop motion profile
    axes[axis].profile.moveActive = false;
    axes[axis].profile.currentPhase = MotionProfile::IDLE;
    axes[axis].stepsToGo = 0;
    axes[axis].moving = false;
    axes[axis].state = AxisConfig::IDLE;
    
    Serial.printf("Axis %d disabled (invert=%s)\n", axis, axes[axis].invertEnable ? "true" : "false");
    return true;
}

bool ESP32MotionControl::isAxisEnabled(int axis) {
    if (axis < 0 || axis >= 2) return false;
    return axes[axis].enabled;
}

bool ESP32MotionControl::isAxisMoving(int axis) {
    if (axis < 0 || axis >= 2) return false;
    return axes[axis].moving;
}

void ESP32MotionControl::startTestSequence() {
    if (testSequence.active) {
        Serial.println("Test sequence already running!");
        return;
    }
    
    if (emergencyStop) {
        Serial.println("Cannot start test sequence - Emergency stop active!");
        return;
    }
    
