gueee/nanoELS-flow/nanoELS-flow/ESP32MotionControl.cpp
    // Enable both axes
    enableAxis(0);
    enableAxis(1);
    
    // Reset test sequence
    testSequence.currentMove = 0;
    testSequence.cycleCount = 0;
    testSequence.moveStartTime = 0;
    testSequence.active = true;
    testSequence.completed = false;
    
    Serial.println("=== TEST SEQUENCE STARTED ===");
    Serial.println("3 cycles of: Z left 20mm → X in 8mm → Z right 20mm → X out 8mm");
    Serial.printf("SAFETY: All moves within limits (X=±%.0fmm, Z=±%.0fmm)\n", MAX_TRAVEL_MM_X, MAX_TRAVEL_MM_Z);
    Serial.println("SAFETY: Press ESC for immediate emergency stop");
    Serial.println("SAFETY: Hardware-specific pin inversion active");
    Serial.println("==============================");
}

void ESP32MotionControl::stopTestSequence() {
    bool wasActive = testSequence.active;
    
    testSequence.active = false;
    testSequence.completed = false;
    testSequence.moveStartTime = 0;
    
    // Stop all motion profiles immediately
    for (int i = 0; i < 2; i++) {
        axes[i].profile.moveActive = false;
        axes[i].profile.currentPhase = MotionProfile::IDLE;
        axes[i].stepsToGo = 0;
        axes[i].moving = false;
        axes[i].state = AxisConfig::IDLE;
    }
    
    if (wasActive) {
        Serial.println("=== TEST SEQUENCE STOPPED ===");
        Serial.println("All motion halted immediately");
        Serial.println("Press ENTER to restart test sequence");
        Serial.println("==============================");
    }
}

bool ESP32MotionControl::isTestSequenceActive() {
    return testSequence.active;
}

bool ESP32MotionControl::isTestSequenceCompleted() {
    return testSequence.completed;
}

void ESP32MotionControl::restartTestSequence() {
    // Stop current sequence if active
    if (testSequence.active) {
        stopTestSequence();
        delay(100);  // Small delay to ensure stop completes
    }
    
    // Reset completion flag and start fresh
    testSequence.completed = false;
    startTestSequence();
}

String ESP32MotionControl::getTestSequenceStatus() {
    if (emergencyStop) {
        return "EMERGENCY STOP ACTIVE";
    } else if (testSequence.active) {
        return "RUNNING - Cycle " + String(testSequence.cycleCount + 1) + "/" + String(testSequence.maxCycles) + 
               ", Move " + String(testSequence.currentMove + 1) + "/4";
    } else if (testSequence.completed) {
        return "COMPLETED - Press ENTER to restart";
    } else {
        return "IDLE - Press ENTER to start";
    }
}

void ESP32MotionControl::setPIDGains(int axis, float kP, float kI, float kD) {
    if (axis < 0 || axis >= 2) return;
    
    axes[axis].pid.kP = kP;
    axes[axis].pid.kI = kI;
    axes[axis].pid.kD = kD;
    
    Serial.printf("Axis %d PID gains: P=%.2f, I=%.2f, D=%.2f\n", axis, kP, kI, kD);
}

void ESP32MotionControl::getPIDGains(int axis, float& kP, float& kI, float& kD) {
    if (axis < 0 || axis >= 2) return;
    
    kP = axes[axis].pid.kP;
    kI = axes[axis].pid.kI;
    kD = axes[axis].pid.kD;
}

void ESP32MotionControl::setEmergencyStop(bool stop) {
    emergencyStop = stop;
    
    if (stop) {
        // Stop all motion profiles immediately
        for (int i = 0; i < 2; i++) {
            axes[i].profile.moveActive = false;
            axes[i].profile.currentPhase = MotionProfile::IDLE;
            axes[i].stepsToGo = 0;
            axes[i].moving = false;
            axes[i].state = AxisConfig::IDLE;
        }
        
        // Stop test sequence
        stopTestSequence();
        
        Serial.println("*** EMERGENCY STOP ACTIVATED ***");
    } else {
        Serial.println("Emergency stop released");
    }
}

String ESP32MotionControl::getStatusReport() {
    String report = "Motion Control Status (ClearPath-Enhanced):\n";
    
    for (int i = 0; i < 2; i++) {
        char axisName = (i == 0) ? 'X' : 'Z';
        report += String(axisName) + "-axis: ";
        report += "Pos=" + String(getPosition(i), 2) + "mm ";
        report += "Target=" + String(getTargetPosition(i), 2) + "mm ";
        report += "Error=" + String(getPositionError(i), 2) + "mm ";
        report += "Steps=" + String(axes[i].stepCount) + " ";
        report += "Vel=" + String(getProfileVelocity(i), 1) + "mm/s ";
        
        // Motion phase
        switch (axes[i].profile.currentPhase) {
            case MotionProfile::IDLE: report += "IDLE"; break;
            case MotionProfile::ACCELERATION: report += "ACCEL"; break;
            case MotionProfile::CONSTANT_VELOCITY: report += "CONST"; break;
            case MotionProfile::DECELERATION: report += "DECEL"; break;
            case MotionProfile::COMPLETED: report += "DONE"; break;
        }
        report += "\n";
    }
    
    if (testSequence.active) {
        report += "Test: Cycle " + String(testSequence.cycleCount + 1) + "/" + String(testSequence.maxCycles);
        report += " Move " + String(testSequence.currentMove + 1) + "/4\n";
    }
    
    return report;
}

void ESP32MotionControl::printDiagnostics() {
    Serial.println("=== ESP32 Motion Control Diagnostics ===");
    Serial.print(getStatusReport());
    
    // PID status
    for (int i = 0; i < 2; i++) {
        char axisName = (i == 0) ? 'X' : 'Z';
        Serial.printf("%c-axis PID: P=%.2f I=%.2f D=%.2f\n", 
                     axisName, axes[i].pid.kP, axes[i].pid.kI, axes[i].pid.kD);
    }
    
    Serial.println("==========================================");
}

void ESP32MotionControl::update() {
    // Main update called from loop() - most work done in FreeRTOS task
    // No auto-start - waiting for manual control via keyboard
}